import enum


@enum.unique
class ResultCodes(enum.IntEnum):
    """
    Коды статусов обработки запроса в теле ответа API

    Коды:
        0 - успешность обратки запроса
        1 - ошибка обработки запроса (без уточнения какая именно произошла ошибка)
        2-9 - зарезервированы под возможные системные статусы обработки
        >=10 - коды ошибок приложения
    """

    # =========================== System codes ===========================
    SUCCESS = 0
    ERROR = 1
    # 2-9 system reserved codes
    # =========================== Domain codes ===========================
    # DDOS/Security (10-29)
    UNKNOWN_CLIENT = 10  # запрос с неизвестного клиента
    TOO_MANY_REQUESTS = 11  # слишком много запросов
